**** BoA vs Loan Depot vs Axos
| Item               | Axos |      LD |  BoA | Notes                            |
|--------------------+------+---------+------+----------------------------------|
| Origination fee    |  995 |    1595 |  740 |                                  |
| Appraisal          |  450 |     475 |  610 |                                  |
| Credit report      |   23 |   20.36 |   30 |                                  |
| Tax service        |      |      68 |   79 |                                  |
| Flood              |    7 |      10 |   12 | 8+4                              |
| MERS registration  |   12 |   11.95 |      |                                  |
| Title-settlement   |  450 |     500 |  355 |                                  |
| Title ins          |  400 |     400 |  560 | only this title category matched |
| Title CPL          |   25 |      25 |  100 |                                  |
| Title Svc Fee      |   16 |         |      |                                  |
| Recording          |   84 |      42 |  100 |                                  |
| Doc Prep           |   32 |         |      |                                  |
| Loan Safe Fee      |   15 |         |      |                                  |
| "prepaid" per diem |      |  342.86 |  125 | "recording" for BoA              |
| "prepaid" tax+ins  | 1115 | 1177.31 | 2030 |                                  |
| points             |  676 |         | 1902 |                                  |
| Total              | 4300 | 4667.48 | 6643 |                                  |
#+TBLFM: @>$2=vsum(@2..@-1)
#+TBLFM: @>$3=vsum(@2..@-1)
#+TBLFM: @>$4=vsum(@2..@-1)

